<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/b3bd75c3-92ef-40fb-9a8b-2eeac7618372/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.analytics.aws_kms_alias.analytics_bucket will be created
  + resource "aws_kms_alias" "analytics_bucket" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/analytics/cast/staging"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.analytics.aws_kms_key.analytics_bucket will be created
  + resource "aws_kms_key" "analytics_bucket" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "cast.staging - analytics bucket encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Name"      = "walletconnect-staging-cast"
          + "Namespace" = "walletconnect"
          + "Stage"     = "staging"
        }
    }

  # module.analytics.aws_s3_bucket.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket" "analytics-data-lake_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "walletconnect.cast.staging.analytics.data-lake"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Name"      = "walletconnect-staging-cast"
          + "Namespace" = "walletconnect"
          + "Stage"     = "staging"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.analytics.aws_s3_bucket_acl.analytics-data-lake_acl will be created
  + resource "aws_s3_bucket_acl" "analytics-data-lake_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.analytics.aws_s3_bucket_public_access_block.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "analytics-data-lake_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.analytics.aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "analytics-data-lake_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.analytics.aws_s3_bucket_versioning.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket_versioning" "analytics-data-lake_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-cast/staging-cast-service"
        name                               = "staging-cast-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:29" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:29" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging-cast" -> (known after apply)
      ~ revision                 = 29 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.o11y.grafana_data_source.cloudwatch will be updated in-place
  ~ resource "grafana_data_source" "cloudwatch" {
        id                 = "101"
      ~ json_data_encoded  = jsonencode(
          ~ {
              - manageAlerts  = false
              - sigV4Auth     = false
              - timescaledb   = false
              - xpack         = false
                # (1 unchanged attribute hidden)
            }
        )
        name               = "staging-staging-cast-cloudwatch"
        # (5 unchanged attributes hidden)

      - json_data {
          - conn_max_lifetime             = 0 -> null
          - default_region                = "eu-central-1" -> null
          - manage_alerts                 = false -> null
          - max_concurrent_shard_requests = 0 -> null
          - max_idle_conns                = 0 -> null
          - max_lines                     = 0 -> null
          - max_open_conns                = 0 -> null
          - postgres_version              = 0 -> null
          - sigv4_auth                    = false -> null
          - timescaledb                   = false -> null
          - tls_auth                      = false -> null
          - tls_auth_with_ca_cert         = false -> null
          - tls_skip_verify               = false -> null
          - tsdb_resolution               = 0 -> null
          - tsdb_version                  = 0 -> null
          - xpack_enabled                 = false -> null
        }
    }

  # module.o11y.grafana_data_source.prometheus will be updated in-place
  ~ resource "grafana_data_source" "prometheus" {
        id                 = "102"
      ~ json_data_encoded  = jsonencode(
          ~ {
              - timescaledb   = false
              - xpack         = false
                # (5 unchanged attributes hidden)
            }
        )
        name               = "staging-staging-cast-amp"
        # (6 unchanged attributes hidden)

      - json_data {
          - conn_max_lifetime             = 0 -> null
          - http_method                   = "GET" -> null
          - manage_alerts                 = false -> null
          - max_concurrent_shard_requests = 0 -> null
          - max_idle_conns                = 0 -> null
          - max_lines                     = 0 -> null
          - max_open_conns                = 0 -> null
          - postgres_version              = 0 -> null
          - sigv4_auth                    = true -> null
          - sigv4_auth_type               = "workspace-iam-role" -> null
          - sigv4_region                  = "eu-central-1" -> null
          - timescaledb                   = false -> null
          - tls_auth                      = false -> null
          - tls_auth_with_ca_cert         = false -> null
          - tls_skip_verify               = false -> null
          - tsdb_resolution               = 0 -> null
          - tsdb_version                  = 0 -> null
          - xpack_enabled                 = false -> null
        }
    }

Plan: 8 to add, 3 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.analytics.aws_kms_alias.analytics_bucket will be created%0A  + resource "aws_kms_alias" "analytics_bucket" {%0A      + arn            = (known after apply)%0A      + id             = (known after apply)%0A      + name           = "alias/analytics/cast/staging"%0A      + name_prefix    = (known after apply)%0A      + target_key_arn = (known after apply)%0A      + target_key_id  = (known after apply)%0A    }%0A%0A  # module.analytics.aws_kms_key.analytics_bucket will be created%0A  + resource "aws_kms_key" "analytics_bucket" {%0A      + arn                                = (known after apply)%0A      + bypass_policy_lockout_safety_check = false%0A      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"%0A      + deletion_window_in_days            = 10%0A      + description                        = "cast.staging - analytics bucket encryption"%0A      + enable_key_rotation                = true%0A      + id                                 = (known after apply)%0A      + is_enabled                         = true%0A      + key_id                             = (known after apply)%0A      + key_usage                          = "ENCRYPT_DECRYPT"%0A      + multi_region                       = (known after apply)%0A      + policy                             = (known after apply)%0A      + tags_all                           = {%0A          + "Name"      = "walletconnect-staging-cast"%0A          + "Namespace" = "walletconnect"%0A          + "Stage"     = "staging"%0A        }%0A    }%0A%0A  # module.analytics.aws_s3_bucket.analytics-data-lake_bucket will be created%0A  + resource "aws_s3_bucket" "analytics-data-lake_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "walletconnect.cast.staging.analytics.data-lake"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = {%0A          + "Name"      = "walletconnect-staging-cast"%0A          + "Namespace" = "walletconnect"%0A          + "Stage"     = "staging"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.analytics.aws_s3_bucket_acl.analytics-data-lake_acl will be created%0A  + resource "aws_s3_bucket_acl" "analytics-data-lake_acl" {%0A      + acl    = "private"%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A    }%0A%0A  # module.analytics.aws_s3_bucket_public_access_block.analytics-data-lake_bucket will be created%0A  + resource "aws_s3_bucket_public_access_block" "analytics-data-lake_bucket" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # module.analytics.aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "analytics-data-lake_bucket" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + rule {%0A          + bucket_key_enabled = true%0A%0A          + apply_server_side_encryption_by_default {%0A              + kms_master_key_id = (known after apply)%0A              + sse_algorithm     = "aws:kms"%0A            }%0A        }%0A    }%0A%0A  # module.analytics.aws_s3_bucket_versioning.analytics-data-lake_bucket will be created%0A  + resource "aws_s3_bucket_versioning" "analytics-data-lake_bucket" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-cast/staging-cast-service"%0A        name                               = "staging-cast-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:29" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task_definition" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:29" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "staging-cast" -> (known after apply)%0A      ~ revision                 = 29 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.o11y.grafana_data_source.cloudwatch will be updated in-place%0A  ~ resource "grafana_data_source" "cloudwatch" {%0A        id                 = "101"%0A      ~ json_data_encoded  = jsonencode(%0A          ~ {%0A              - manageAlerts  = false%0A              - sigV4Auth     = false%0A              - timescaledb   = false%0A              - xpack         = false%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A        name               = "staging-staging-cast-cloudwatch"%0A        # (5 unchanged attributes hidden)%0A%0A      - json_data {%0A          - conn_max_lifetime             = 0 -> null%0A          - default_region                = "eu-central-1" -> null%0A          - manage_alerts                 = false -> null%0A          - max_concurrent_shard_requests = 0 -> null%0A          - max_idle_conns                = 0 -> null%0A          - max_lines                     = 0 -> null%0A          - max_open_conns                = 0 -> null%0A          - postgres_version              = 0 -> null%0A          - sigv4_auth                    = false -> null%0A          - timescaledb                   = false -> null%0A          - tls_auth                      = false -> null%0A          - tls_auth_with_ca_cert         = false -> null%0A          - tls_skip_verify               = false -> null%0A          - tsdb_resolution               = 0 -> null%0A          - tsdb_version                  = 0 -> null%0A          - xpack_enabled                 = false -> null%0A        }%0A    }%0A%0A  # module.o11y.grafana_data_source.prometheus will be updated in-place%0A  ~ resource "grafana_data_source" "prometheus" {%0A        id                 = "102"%0A      ~ json_data_encoded  = jsonencode(%0A          ~ {%0A              - timescaledb   = false%0A              - xpack         = false%0A                # (5 unchanged attributes hidden)%0A            }%0A        )%0A        name               = "staging-staging-cast-amp"%0A        # (6 unchanged attributes hidden)%0A%0A      - json_data {%0A          - conn_max_lifetime             = 0 -> null%0A          - http_method                   = "GET" -> null%0A          - manage_alerts                 = false -> null%0A          - max_concurrent_shard_requests = 0 -> null%0A          - max_idle_conns                = 0 -> null%0A          - max_lines                     = 0 -> null%0A          - max_open_conns                = 0 -> null%0A          - postgres_version              = 0 -> null%0A          - sigv4_auth                    = true -> null%0A          - sigv4_auth_type               = "workspace-iam-role" -> null%0A          - sigv4_region                  = "eu-central-1" -> null%0A          - timescaledb                   = false -> null%0A          - tls_auth                      = false -> null%0A          - tls_auth_with_ca_cert         = false -> null%0A          - tls_skip_verify               = false -> null%0A          - tsdb_resolution               = 0 -> null%0A          - tsdb_version                  = 0 -> null%0A          - xpack_enabled                 = false -> null%0A        }%0A    }%0A%0APlan: 8 to add, 3 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*